fn main() {
    const SIZE: usize = 5; // розмір ромба

    // Малюємо верхню частину ромба
    for i in 0..SIZE {
        for j in 0..(SIZE - i - 1) {
            print!(" "); // Додаємо пробіли зліва
        }
        for j in 0..(2 * i + 1) {
            print!("*"); // Малюємо зірочки
        }
        println!(); // Перехід на новий рядок
    }

    // Малюємо нижню частину ромба
    for i in (0..SIZE - 1).rev() {
        for j in 0..(SIZE - i - 1) {
            print!(" "); // Додаємо пробіли зліва
        }
        for j in 0..(2 * i + 1) {
            print!("*"); // Малюємо зірочки
        }
        println!(); // Перехід на новий рядок
    }
}
